In [1]:
import pandas as pd

In [2]:
movies=['Kantara','bahubali','titanic','A','manjumaliBoys',]
rating=[8,9,None,7.4,8.7]
language_year=['kannada-2023','telugu-2018','english-2002','kannada-2003','malyalam-2024']
cast=[['Rishab,actress'],['prabas,anushka'],['ketevinslate,actor'],['upendra,actress'],['Subhash,actor']]
prime=['yes','yes','no','no','yes']
hotstar=['no','yes','yes','yes','no']


d={'Movies_names':movies,
   'Movie_rating':rating,
   'Language_year':language_year,
   'Movie_cast':cast,
   'prime_ott':prime,
   'hotstar_ott':hotstar}

In [3]:
moviedetails=pd.DataFrame(d)
moviedetails

,Movies_names,Movie_rating,Language_year,Movie_cast,prime_ott,hotstar_ott
0,Kantara,8.0,kannada-2023,"[Rishab,actress]",yes,no
1,bahubali,9.0,telugu-2018,"[prabas,anushka]",yes,yes
2,titanic,NaN,english-2002,"[ketevinslate,actor]",no,yes
3,A,7.4,kannada-2003,"[upendra,actress]",no,yes
4,manjumaliBoys,8.7,malyalam-2024,"[Subhash,actor]",yes,no

In [4]:
moviedetails.head()
moviedetails.tail()

,Movies_names,Movie_rating,Language_year,Movie_cast,prime_ott,hotstar_ott
0,Kantara,8.0,kannada-2023,"[Rishab,actress]",yes,no
1,bahubali,9.0,telugu-2018,"[prabas,anushka]",yes,yes
2,titanic,NaN,english-2002,"[ketevinslate,actor]",no,yes
3,A,7.4,kannada-2003,"[upendra,actress]",no,yes
4,manjumaliBoys,8.7,malyalam-2024,"[Subhash,actor]",yes,no

In [5]:
moviedetails.head(2)
df=moviedetails

In [6]:
df['Movies_names']=df['Movies_names'].str.title()
df=df.replace({'yes':1,'no':0})

C:\Users\ADMIN\AppData\Local\Temp\ipykernel_20924\616584139.py:2: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df=df.replace({'yes':1,'no':0})

In [7]:
df['Language_year'].str.split('-')
df['Language_year'].str.split('-',expand=True)

          0     1
0   kannada  2023
1    telugu  2018
2   english  2002
3   kannada  2003
4  malyalam  2024

In [8]:

df[  ['Language','year']  ]=df['Language_year'].str.split('-',expand=True)

In [9]:
df=df.drop(columns=['Language_year'])

In [10]:
df=df.astype({'year':int})

In [11]:
df.loc[[0,1,2]]
df.loc[[3,2],['Movie_rating','Movies_names']]

   Movie_rating Movies_names
3           7.4            A
2           NaN      Titanic

In [12]:
df.loc[df['Movies_names']=='Kantara']

,Movies_names,Movie_rating,Movie_cast,prime_ott,hotstar_ott,Language,year
0,Kantara,8.0,"[Rishab,actress]",1,0,kannada,2023

In [13]:
df['Movies_names']==2018

0    False
1    False
2    False
3    False
4    False
Name: Movies_names, dtype: bool

In [14]:
df.loc[(df['Language']=='Telugu') & (df['hotstar_ott']==1)]

Empty DataFrame
Columns: [Movies_names, Movie_rating, Movie_cast, prime_ott, hotstar_ott, Language, year]
Index: []

In [15]:
df.loc[(df['Language']=='Telugu') | (df['hotstar_ott']==1)]

,Movies_names,Movie_rating,Movie_cast,prime_ott,hotstar_ott,Language,year
1,Bahubali,9.0,"[prabas,anushka]",1,1,telugu,2018
2,Titanic,NaN,"[ketevinslate,actor]",0,1,english,2002
3,A,7.4,"[upendra,actress]",0,1,kannada,2003

In [16]:
df.to_csv('m1.csv')
df.to_excel('m11.xlsx')
df.to_excel('m12.xlsx',index=False)

In [17]:
pd.read_excel('m12.xlsx')

,Movies_names,Movie_rating,Movie_cast,prime_ott,hotstar_ott,Language,year
0,Kantara,8.0,"['Rishab,actress']",1,0,kannada,2023
1,Bahubali,9.0,"['prabas,anushka']",1,1,telugu,2018
2,Titanic,NaN,"['ketevinslate,actor']",0,1,english,2002
3,A,7.4,"['upendra,actress']",0,1,kannada,2003
4,Manjumaliboys,8.7,"['Subhash,actor']",1,0,malyalam,2024

In [18]:
df['Movie_rating']=df['Movie_rating'].fillna(9)

In [19]:
df['total_platform']=df['prime_ott']+df['hotstar_ott']

In [20]:
df['Movie_cast']=df['Movie_cast'].astype(str)

In [21]:
df['Movie_cast']=df['Movie_cast'].str.strip('][')
df

,Movies_names,Movie_rating,Movie_cast,prime_ott,hotstar_ott,Language,year,total_platform
0,Kantara,8.0,"'Rishab,actress'",1,0,kannada,2023,1
1,Bahubali,9.0,"'prabas,anushka'",1,1,telugu,2018,2
2,Titanic,9.0,"'ketevinslate,actor'",0,1,english,2002,1
3,A,7.4,"'upendra,actress'",0,1,kannada,2003,1
4,Manjumaliboys,8.7,"'Subhash,actor'",1,0,malyalam,2024,1

In [22]:
df['Movie_cast']=df['Movie_cast'].str.replace("'","")
df['Movie_cast']

0        Rishab,actress
1        prabas,anushka
2    ketevinslate,actor
3       upendra,actress
4         Subhash,actor
Name: Movie_cast, dtype: object

In [23]:
df['Movie_cast']=df['Movie_cast'].str.replace(",","-")
df

,Movies_names,Movie_rating,Movie_cast,prime_ott,hotstar_ott,Language,year,total_platform
0,Kantara,8.0,Rishab-actress,1,0,kannada,2023,1
1,Bahubali,9.0,prabas-anushka,1,1,telugu,2018,2
2,Titanic,9.0,ketevinslate-actor,0,1,english,2002,1
3,A,7.4,upendra-actress,0,1,kannada,2003,1
4,Manjumaliboys,8.7,Subhash-actor,1,0,malyalam,2024,1

In [24]:
pd.melt(df,value_vars=['prime_ott','hotstar_ott'])
pd.melt(df,value_vars=['prime_ott','hotstar_ott'],var_name='OTT',value_name='availability')
df1=pd.melt(df,value_vars=['prime_ott','hotstar_ott'],
        id_vars=['Movies_names','Movie_rating'],var_name='OTT',value_name='availability')
df1

    Movies_names  Movie_rating          OTT  availability
0        Kantara           8.0    prime_ott             1
1       Bahubali           9.0    prime_ott             1
2        Titanic           9.0    prime_ott             0
3              A           7.4    prime_ott             0
4  Manjumaliboys           8.7    prime_ott             1
5        Kantara           8.0  hotstar_ott             0
6       Bahubali           9.0  hotstar_ott             1
7        Titanic           9.0  hotstar_ott             1
8              A           7.4  hotstar_ott             1
9  Manjumaliboys           8.7  hotstar_ott             0

In [25]:
df1=df1.loc[df1['availability']==1]

In [26]:
df1=df1.drop(columns='availability')
df1

    Movies_names  Movie_rating          OTT
0        Kantara           8.0    prime_ott
1       Bahubali           9.0    prime_ott
4  Manjumaliboys           8.7    prime_ott
6       Bahubali           9.0  hotstar_ott
7        Titanic           9.0  hotstar_ott
8              A           7.4  hotstar_ott

In [27]:
df1['OTT']=df1['OTT'].str.capitalize()
df1

    Movies_names  Movie_rating          OTT
0        Kantara           8.0    Prime_ott
1       Bahubali           9.0    Prime_ott
4  Manjumaliboys           8.7    Prime_ott
6       Bahubali           9.0  Hotstar_ott
7        Titanic           9.0  Hotstar_ott
8              A           7.4  Hotstar_ott

In [28]:
df1['Movie_rating'].agg('count')

np.int64(6)

In [29]:
df1.agg({'Movies_names':['count','min'],'Movie_rating':['sum','min','max']})

      Movies_names  Movie_rating
count            6           NaN
min              A           7.4
sum            NaN          51.1
max            NaN           9.0

In [30]:
df1.groupby('OTT').agg({'Movie_rating':['min','max']})

            Movie_rating
                     min  max
OTT
Hotstar_ott          7.4  9.0
Prime_ott            8.0  9.0

In [31]:
grp_by=df1.groupby('OTT')
grp_by.agg({'Movie_rating':['min','max']})

            Movie_rating
                     min  max
OTT
Hotstar_ott          7.4  9.0
Prime_ott            8.0  9.0